scr1c/InformationRegisters/ТарифНаПереправу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТарифНаПереправу</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

scr1c/InformationRegisters/ТарифНаПереправу/Ext/ManagerModule.bsl
Функция ПолучитьТариф(КА,Ном) Экспорт
	
	Запрос = новый Запрос; 
	Запрос.УстановитьПараметр("Контрагент",КА);
	Запрос.УстановитьПараметр("Номенклатура",Ном);
	Запрос.Текст ="ВЫБРАТЬ TOP 1
	              |	ТарифНаПереправуСрезПоследних.Тариф КАК Тариф, Контрагент
	              |ИЗ
	              |	РегистрСведений.ТарифНаПереправу.СрезПоследних КАК ТарифНаПереправуСрезПоследних
	              |ГДЕ
	              |	ТарифНаПереправуСрезПоследних.Контрагент IN (&Контрагент,Значение(Справочник.Контрагенты.ПустаяССылка))
	              |	И ТарифНаПереправуСрезПоследних.Номенклатура = &Номенклатура
				  |
				  |ORDER BY Контрагент DESC
				  |"; 
	
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		Возврат Выб.Тариф;
	ИНаче
		Возврат 0;
	КонецеслИ;
	
КонецФункции
